<a href="https://colab.research.google.com/github/CharlesPrado23/Bootcamp2oSemestre2021/blob/main/Semana6/SQLxPANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import sqlite3 as sql

In [4]:
engine = sql.connect('temp1000.db')
cursor= engine.cursor()

In [5]:
url = "https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv"
tips = pd.read_csv(url)

In [6]:
tips.to_sql('tipsDB', con=engine)

- Visualizar as 5 primeiras Linhas

In [ ]:
### SQL ####

In [1]:
### PANDAS ###

- Selecionar algumas Colunas 

- Total_bill, tip, smoker, time

In [ ]:
### SQL ###

In [ ]:
### PANDAS ####

 - Assign Nova Coluna 

 - tip_rate = tip/total_bill

In [ ]:
### SQL ####

In [ ]:
### PANDAS ###

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [ ]:
### WHERE - SQL ####

In [ ]:
### WHERE - PANDAS ####

In [ ]:
### WHERE - SQL ###
### time = Dinner AND tip > 5.00 ###

In [ ]:
### WHERE - PANDAS ###
### time = Dinner AND tip > 5.00 ###

In [ ]:
### IS NULL - SQL ####

In [ ]:
### IS NULL - PANDAS ####

In [ ]:
### GROUP BY - SQL ###
sql_groupby = 'SELECT sex, count(*) FROM tipsDB GROUP BY sex'
cursor.execute(sql_groupby).fetchall()

[('Female', 87), ('Male', 157)]

In [ ]:
### GROUP BY - PANDAS ###
tips.groupby('sex').size()

In [ ]:
### GROUP BY - SQL USANDO FUNCOES NATIVAS DO SQL  ###

In [ ]:
### GROUP BY - SQL USANDO FUNCOES NATIVAS DO PANDAS  ###

In [ ]:
import numpy as np
values = np.random.randn(4)
values = np.append(values,np.nan)

df1 = pd.DataFrame({"key": ["A", "B", "C", "D","E"], "value": values})
df2 = pd.DataFrame({"key": ["B", "D", "D", "E"], "value": np.random.randn(4)})


df1.to_sql('df1DB', con=engine)
df2.to_sql('df2DB', con=engine)

In [ ]:
### INNER_JOIN - SQL ####

sql_join = 'SELECT * FROM df1DB INNER JOIN df2DB ON df1DB.key = df2DB.key'
cursor.execute(sql_join).fetchall()

In [ ]:
### INNER_JOIN - PANDAS ####

In [ ]:
### LEFT JOIN - SQL ####

In [ ]:
### LEFT JOIN - PANDAS ####